runs/stateful/full_paper/exp2_multi_agent_scaling_llama3_sglang/sglang_runs/meta-llama_Meta-Llama-3-8B-Instruct/ctx4096_out64_a4_b4_s0/sglang_bench_raw.txt
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=23014, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer='meta-llama/Meta-Llama-3-8B-Instruct', num_prompts=16, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:23014/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=23014, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer='meta-llama/Meta-Llama-3-8B-Instruct', num_prompts=16, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 34776
#Output tokens: 492
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     16        
Benchmark duration (s):                  1.85      
Total input tokens:                      34776     
Total input text tokens:                 34776     
Total generated tokens:                  492       
Total generated tokens (retokenized):    492       
Request throughput (req/s):              8.64      
Input token throughput (tok/s):          18776.51  
Output token throughput (tok/s):         265.64    
Peak output token throughput (tok/s):    480.00    
Peak concurrent requests:                16        
Total token throughput (tok/s):          19042.15  
Concurrency:                             13.77     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   1593.41   
Median E2E Latency (ms):                 1572.28   
P90 E2E Latency (ms):                    1788.79   
P99 E2E Latency (ms):                    1836.27   
---------------Time to First Token----------------
Mean TTFT (ms):                          825.61    
Median TTFT (ms):                        963.50    
P99 TTFT (ms):                           1345.35   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.04     
Median TPOT (ms):                        24.47     
P99 TPOT (ms):                           188.32    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           25.81     
Median ITL (ms):                         8.31      
P95 ITL (ms):                            9.45      
P99 ITL (ms):                            693.82    
Max ITL (ms):                            1223.00   
==================================================


  0%|          | 0/16 [00:00<?, ?it/s]
  6%|▋         | 1/16 [00:01<00:20,  1.38s/it]
 31%|███▏      | 5/16 [00:01<00:02,  4.31it/s]
 69%|██████▉   | 11/16 [00:01<00:00, 10.17it/s]
 94%|█████████▍| 15/16 [00:01<00:00, 12.98it/s]
100%|██████████| 16/16 [00:01<00:00,  8.70it/s]